Repository: 84000/data-translation-memory
Catalog: toh231-v1.tmx
Source language: bo
Languages: en

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཟང་ཟིང་གི་སྦྱིན་པ་ཕུན་སུམ་ཚོགས་པ་ཡིན་ནོ།
en: Such is the bodhisattvas’ perfect giving of material things.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ལན་དུ་ཕན་འདོགས་པ་ལ་མི་རེ་བའི་སྦྱིན་པ་ཕུན་སུམ་ཚོགས་པ་ཡིན་ཞེ་ན།
en: “What, you may wonder, does the bodhisattvas’ perfect giving free of expectation of a reward consist in?

source: བྱང་ཆུབ་སེམས་དཔའ་སྦྱིན་པ་སྦྱིན་པ་ཡང་འདོད་པའི་ཕྱིར་སྦྱིན་པ་མི་སྦྱིན།
en: The bodhisattvas’ practice of generosity is not based on desire.

source: ཕན་འདོགས་སུ་རེ་བའི་ཕྱིར་མ་ཡིན།
en: They do not hope to benefit from it.

source: དོན་གྱི་ཕྱིར་མ་ཡིན། གཡོག་གི་ཕྱིར་མ་ཡིན།
en: Their practice of generosity has no objective and is not seeking services.

source: འཇིག་རྟེན་གྱི་ཚུལ་གྱི་ཕྱིར་མ་ཡིན་གྱི། གཞན་དུ་ན་འདི་སྙམ་དུ་སེམས་ཏེ།
en: It is not practiced out of worldly concerns. Rather, they think,

source: གང་བྱང་ཆུབ་སེམས་དཔའ་སྦྱིན་པའི་ངང་ཚུལ་ཅན་དུ་འགྱུར་བ་འདི་ནི་ཆོས་ཉིད་ཡིན་ནོ་སྙམ་སྟེ།
en: ‘Bodhisattvas are generous, that is just how it is,’

source: དེ་རྒྱུ་དེ་དང་རྐྱེན་དེ་དང་གཞིས་ཕན་བཏགས་པའི་ལན་དུ་ཕན་འདོགས་པ་ཐམས་ཅད་ལ་མི་རེ་བར་སྦྱིན་པ་སྦྱིན་པར་བྱེད་དེ།
en: and so they are generous without any hope that the causes, conditions, or bases of their generosity will bring any reward.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ལན་དུ་ཕན་འདོགས་པ་ལ་མི་རེ་བའི་སྦྱིན་པ་ཕུན་སུམ་ཚོགས་པ་ཡིན་ནོ།
en: Such is the bodhisattvas’ perfect giving free of expectation of a reward.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སྙིང་རྗེ་བའི་སྦྱིན་པ་ཕུན་སུམ་ཚོགས་པ་ཡིན་ཞེ་ན།
en: “What, you may wonder, does the bodhisattvas’ perfect giving of compassion consist in?

source: འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་ཅན་སྡུག་བསྔལ་བ་དང་།
en: When bodhisattvas witness sentient beings who suffer,

source: བཀྲེས་པ་དང་། སྐོམ་པ་དང་། གཅེར་བུ་དང་། གོས་ངན་པ་དང་། བགོ་བ་ངན་པ་དང་།
en: who are starving, who are thirsting, who go naked, who wear poor garments, whose clothing is poor,

source: མགོན་མེད་པ་དང་། དཔུང་གཉེན་མེད་པ་དང་། སྐྱབས་མེད་པ་དང་། གནས་མེད་པ་དང་། རྟེན་མེད་པ་
en: whom nobody protects, who have no guardian, who have no savior, who are homeless, and who lack support,

source: བསོད་ནམས་མེད་པ་དག་མཐོང་ན། དེ་དག་ལ་སྙིང་རྗེ་བའི་སེམས་རབ་ཏུ་སྐྱེད་ཅིང་།
en: then the sight of those beings who lack merit provokes in them a strong feeling of compassion.

source: དེ་འདི་སྙམ་དུ་སེམས་ཏེ་
en: Thus, they think to themselves,

source: སེམས་ཅན་གང་དག་གི་ཕྱིར་བདག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པའི་
en: ‘It is for the sake of others that I give rise to the mind of unexcelled and complete awakening.

source: སེམས་ཅན་དེ་དག་ནི་སྡུག་བསྔལ་བ། མགོན་མེད་པ། དཔུང་གཉེན་མེད་པ། སྐྱབས་མེད་པ། གནས་མེད་པ། རྟེན་མེད་པ་འདི་དག་ཡིན་ཏེ།
en: And these are indeed beings who suffer, who are unprotected, who have no guardian, and who have no savior, no strength, and no support.

source: ཀུན་ཏུ་འཁྱམ་ན་ནམ་ཞིག་བདག་སེམས་ཅན་དེ་དག་གི་མགོན་དང་། དཔུང་གཉེན་དང་། སྐྱབས་དང་། གནས་དང་། རྟེན་དུ་འགྱུར་སྙམ་ནས།
en: May I at some point be the protector, guardian, savior, strength, and support for all these wandering beings!’

source: དེ་སྙིང་རྗེས་རབ་ཏུ་མི་བཟད་དེ། བདོག་ཅིང་ཡོད་པའི་དངོས་པོས་སེམས་ཅན་དེ་དག་ལ་ཕན་འདོགས་སོ།
en: Thus, out of unbearable compassion they benefit those sentient beings with all that they possess and all that they have.

source: ཕན་བཏགས་པའི་མོད་ལ་སྐྱེས་པའི་དགེ་བའི་རྩ་བ་དེས་ཀྱང་ཁེངས་པར་མི་འགྱུར་ཏེ།
en: Yet they do not become conceited based on the roots of virtue that this creates.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སྙིང་རྗེ་བའི་སྦྱིན་པ་ཕུན་སུམ་ཚོགས་པ་ཡིན་ནོ།
en: Such is the bodhisattvas’ perfect giving of compassion.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་མི་བརྙས་པའི་སྦྱིན་པ་ཕུན་སུམ་ཚོགས་པ་ཡིན་ཞེ་ན།
en: “What, you may wonder, does the bodhisattvas’ perfect giving free of disdain consist in?

source: བྱང་ཆུབ་སེམས་དཔའ་སྦྱིན་པ་སྦྱིན་པ་ན། བོར་བའི་སྦྱིན་པ་མི་སྦྱིན།
en: When bodhisattvas practice generosity they do not give refuse.

source: བརྙས་ཤིང་སྦྱིན་པ་མི་སྦྱིན།
en: They do not give with disdain.

source: གཤེ་ཞིང་སྦྱིན་པ་མི་སྦྱིན། ཉོན་མོངས་ཤིང་སྦྱིན་པ་མི་སྦྱིན།
en: They do not give while scolding and not while upset.

source: ཕྱུག་པས་རྒྱགས་ཤིང་དྲེགས་ཏེ་སྦྱིན་པ་མི་སྦྱིན།
en: They do not give with the arrogance and haughtiness of the wealthy.

source: གྲགས་པ་འདོད་ཅིང་སྦྱིན་པ་མི་སྦྱིན།
en: Their generosity is not motivated by a wish for fame.

source: མང་དུ་ཐོས་པས་རྒྱགས་ཤིང་དྲེགས་པས་སྦྱིན་པ་མི་སྦྱིན་གྱི།
en: They do not give with the arrogance and haughtiness of the learned.

source: ཅི་སྦྱིན་པ་དེ་ཡང་བསྟི་སྟང་དུ་བྱས་ཤིང་སྦྱིན་པ་སྦྱིན་པར་བྱེད་དོ།
en: Whatever they give, they give with respect.

source: བཙུན་པར་བྱས་ཤིང་སྦྱིན་པ་སྦྱིན་པར་བྱེད་དོ། །རི་མོར་བྱས་ཏེ་མཆོད་ཅིང་རང་གི་ལག་ནས་སྦྱིན་པ་སྦྱིན་པར་བྱེད་དོ།
en: They offer it with veneration, and with their own hands.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་མི་བརྙས་པའི་སྦྱིན་པ་ཕུན་སུམ་ཚོགས་པ་ཡིན་ནོ།
en: Such is the bodhisattvas’ perfect giving free of disdain.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་བསྟི་སྟང་གི་སྦྱིན་པ་ཕུན་སུམ་ཚོགས་པ་ཡིན་ཞེ་ན།
en: “What, you may wonder, does the bodhisattvas’ perfect giving of respect consist in?

source: བྱང་ཆུབ་སེམས་དཔས་སློབ་དཔོན་དང་། མཁན་པོ་དང་། བླ་མ་ལྟ་བུ་དང་། ཚངས་པ་མཚུངས་པར་སྤྱོད་པ་དག་མཐོང་ན།
en: When bodhisattvas meet a master, a preceptor, a guru, or a fellow student,

source: ལུས་ཀྱིས་གུས་པ་དང་བཅས་པ་ཡིན། སེམས་ཀྱིས་རི་མོ་དང་བཅས་པ་ཡིན་ཏེ།
en: they acknowledge such individuals with respect and veneration in body and mind.

source: དེས་གུས་པ་བསྐྱེད། རི་མོ་བསྐྱེད་ནས་གུས་པར་སྨྲ་བ་དང་། ཕྱག་འཚལ་བ་དང་། བསྩུ་བ་དང་། ཐལ་མོ་སྦྱར་བ་དང་། འདུད་པའི་ལས་དག་བྱེད་དོ།
en: With reverence and veneration they speak respectfully, pay homage, welcome them, join their palms, and bow to them.

source: དེ་དག་གི་དགེ་བ་དང་ལྡན་པའི་བྱ་བ་དེ་དང་དེ་དག་ལ་ཡང་གྲོགས་སུ་འགྱུར་ཏེ།
en: Thus they will assist those individuals with whichever virtuous deeds they may be engaged in.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་བསྟི་སྟང་གི་སྦྱིན་པ་ཕུན་སུམ་ཚོགས་པ་ཡིན་ནོ།
en: Such is the bodhisattvas’ perfect giving of respect.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་མཆོད་པ་དང་། རིམ་གྲོའི་སྦྱིན་པ་ཕུན་སུམ་ཚོགས་པ་ཡིན་ཞེ་ན།
en: “What, you may wonder, does the bodhisattvas’ perfect giving of reverence and worship consist in?

source: བྱང་ཆུབ་སེམས་དཔའ་སངས་རྒྱས་དང་། ཆོས་དང་དགེ་འདུན་ལ་བྱ་བ་དག་བྱེད་དེ།
en: Bodhisattvas serve the Buddha, the Dharma, and the Saṅgha.

source: ཇི་ལྟར་ན་སངས་རྒྱས་ལ་བྱ་བ་དག་བྱེད་ཅེ་ན།
en: How do they serve the Buddha?

source: དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་དག་དང་། དེ་བཞིན་གཤེགས་པའི་སྐུ་གཟུགས་ལ་
en: At shrines devoted to the thus-gone ones or representations of the bodies of the thus-gone ones

source: སྤོས་སམ། མེ་ཏོག་གམ། བདུག་པའམ། བྱུག་པའམ། སྐྱོང་ནུལ་ལམ། དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་ཞིག་པ་བཅོས་པ་དག་གིས་ཏེ།
en: offer incense, flowers, frankincense, perfumes, or plaster, and they restore shrines that have crumbled.

source: དེ་ལྟར་ན་སངས་རྒྱས་ལ་བྱ་བ་དག་བྱེད་དོ།
en: Thus they act in the service of the Buddha.

source: ཇི་ལྟར་ན་ཆོས་ལ་བྱ་བདག་བྱེད་ཅེ་ན།
en: How, then, do they serve the Dharma?

source: དེ་ཆོས་ཉན་ཏོ། །ཀློག་གོ། །འཆང་ངོ་། །ཡི་གེར་འདྲིའོ། །ཁ་ཏོན་བྱེད་དོ། །ཀུན་ཆུབ་པར་བྱེད་དོ། །སེམས་སོ། །མ་ལོག་པར་སྒོམ་པའི་སྦྱོར་བས་གོམས་པར་བྱེད་དེ།
en: They listen to the Dharma, read the Dharma, retain the Dharma, write it down, recite it, and practice it to perfection.

source: དེ་ལྟར་ན་ཆོས་ལ་བྱ་བ་དག་བྱེད་དོ།
en: Thus they act in the service of the Dharma.

source: ཇི་ལྟར་ན་དགེ་འདུན་ལ་བྱ་བ་དག་བྱེད་ཅེ་ན།
en: How, then, do they serve the Saṅgha?

source: དེ་གོས་དང་། བསོད་སྙོམས་དང་། མལ་ཆ་དང་། ན་བའི་རྐྱེན་སྨན་དང་། ཡོ་བྱད་རྣམས་དང་། ཆུང་ངུ་ན་ཆུ་གྲང་མོ་ཁྱོར་གང་ཙམ་ཡང་དགེ་འདུན་ལ་འབུལ་ཏེ།
en: To the Saṅgha they offer robes, meals, bedding, medicine for healing the sick, and other provisions—even such small things as a cup of cold water.

source: དེ་ལྟར་ན་དགེ་འདུན་ལ་བྱ་བ་དག་བྱེད་དེ།
en: Thus they act in the service of the Saṅgha.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་མཆོད་པ་དང་རིམ་གྲོའི་སྦྱིན་པ་ཕུན་སུམ་ཚོགས་པ་ཡིན་ནོ།
en: Such is the bodhisattvas’ perfect giving of reverence and worship.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་མི་གནས་པའི་སྦྱིན་པ་ཕུན་སུམ་ཚོགས་པ་ཡིན་ཞེ་ན།
en: “What, you may wonder, does the bodhisattvas’ perfect open-ended giving consist in?

source: འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སྦྱིན་པ་བྱིན་པ་ན།
en: When bodhisattvas are generous,

source: སྦྱིན་པ་འདིས་བདག་ལྷའམ་ལྷ་ལ་ལ་ཞིག་ཏུ་ཤོག་ཤིག་ཅེའམ། རྒྱལ་པོའམ་རྒྱལ་པོ་ལ་ལ་ཞིག་ཏུ་ཤོག་ཤིག་ཅེས་དེ་ལྟར་སེམས་མི་སྐྱེད་དེ།
en: they do not wish, ‘By this generosity, may I become such and such a god!’ or ‘May I became such and such a ruler!’

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་མི་གནས་པའི་སྦྱིན་པ་ཕུན་སུམ་ཚོགས་པ་ཡིན་ནོ།
en: Such is the bodhisattvas’ perfect open-ended giving.

source: རིགས་ཀྱི་བུ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཡོངས་སུ་དག་པའི་སྦྱིན་པ་ཕུན་སུམ་ཚོགས་པ་ཡིན་ཞེ་ན།
en: “Noble son, you may also wonder about the bodhisattvas’ perfectly pure giving.

source: རིགས་ཀྱི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སྦྱིན་པ་འདི་དག་ཇི་སྐད་དུ་བཤད་པ་ལ་སོ་སོར་རྟོག་པའི་རང་བཞིན་ཅན་ཡིན་ཏེ་
en: Noble son, bodhisattvas distinguish the various forms of generosity that were just explained,

source: དེ་སྦྱིན་པ་ཅི་དང་ཅི་སྦྱིན་ཡང་། སྦྱིན་པ་དེ་དང་དེ་ལ་སོ་སོར་རྟོག་པའི་རང་བཞིན་ཅན་ཡིན་ནོ།
en: they discern all the various things that they give.

source: དེ་དེ་ལྟར་སོ་སོར་རྟོག་པ་ལ་གང་འདི་སྦྱིན་པའི་ཉེས་པ་དང་། སྦྱིན་པའི་དྲི་མ་དང་། སྦྱིན་པའི་བར་དུ་གཅོད་པ་དེ་དག་མི་འབྱུང་སྟེ།
en: Because of their discernment, their generosity is free of flaws, stains, or obstacles.

source: དེ་ལྟར་ན་རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཡོངས་སུ་དག་པའི་སྦྱིན་པ་ཕུན་སུམ་ཚོགས་པ་ཡིན་ནོ།
en: Such is the bodhisattvas’ perfectly pure giving.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་པོ་དེ་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་སྦྱིན་པ་ཕུན་སུམ་ཚོགས་པ་རྣམས་ཡིན་ནོ།
en: Noble son, bodhisattvas who possess these ten qualities practice excellent generosity.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་ཚུལ་ཁྲིམས་ཕུན་སུམ་ཚོགས་པ་རྣམས་ཡིན་ནོ།
en: “Noble son, bodhisattvas who practice excellent discipline possess ten qualities.

source: བཅུ་གང་ཞེ་ན།
en: What are those ten?

source: འདི་ལྟ་སྟེ། སོ་སོར་ཐར་པའི་སྡོམ་པས་བསྡམས་པ་རྣམས་ཡིན།
en: They are the commitment to the prātimokṣa vows,

source: བྱང་ཆུབ་སེམས་དཔའི་བསླབ་པའི་སྡོམ་པས་བསྡམས་པ་རྣམས་ཡིན།
en: the commitment to the vows of the bodhisattva training,

source: ཉོན་མོངས་པ་ཐམས་ཅད་ཀྱི་ཡོངས་སུ་གདུང་བ་དང་བྲལ་བ་རྣམས་ཡིན།
en: freedom from the pains of the afflictions,

source: ཚུལ་བཞིན་མ་ཡིན་པ་ཡིད་ལ་བྱེད་པ་དང་བྲལ་བ་རྣམས་ཡིན།
en: freedom from incorrect mental engagements,

source: ལས་ཀྱི་འཇིགས་པ་རྣམས་ཡིན།
en: fear of karma,

source: ཁ་ན་མ་ཐོ་བས་འཇིགས་པ་རྣམས་ཡིན།
en: fear of evil,

source: འཇིགས་པར་ལྟ་བ་རྣམས་ཡིན།
en: consideration of danger,

source: ཡང་དག་པར་བླངས་པ་ལ་བརྟན་པ་རྣམས་ཡིན།
en: steadfast commitment,

source: མི་གནས་པའི་ཚུལ་ཁྲིམས་པ་རྣམས་ཡིན།
en: open-ended discipline,

source: འཁོར་གསུམ་ཡོངས་སུ་དག་པའི་ཚུལ་ཁྲིམས་པ་རྣམས་ཡིན་ནོ།
en: discipline that is purified of the three spheres.

source: རིགས་ཀྱི་བུ་དེ་ལ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སོ་སོར་ཐར་པའི་སྡོམ་པས་བསྡམས་པ་རྣམས་ཡིན་ཞེ་ན།
en: “Noble son, you may wonder what their commitment to the prātimokṣa vows consists in.

source: རིགས་ཀྱི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་དེ་བཞིན་གཤེགས་པས་མདོ་སྡེའམ། འདུལ་བའམ། གནས་གང་ཡང་རུང་བ་ལ་ལ་དག་ཏུ་བསླབ་པའི་གནས་འདི་དག་གང་བཅས་པ་
en: Noble son, with respect to the Thus-Gone One’s discourses, discipline, or any other point of training,

source: དེ་དག་སྟོན་པས་བསྟན་པའོ་སྙམ་དུ་སེམས་ཏེ། གནས་དེ་དང་དེ་དག་ལ་ཤིན་ཏུ་ལེགས་པར་སློབ་ཀྱི།
en: they recollect, ‘These are our teacher’s teachings,’ and so they apply themselves to them in a most excellent way.

source: རིགས་ལ་འདོད་ཆགས་པས་མ་ཡིན། ལྟ་བ་ལ་འདོད་ཆགས་པས་མ་ཡིན། འཁོར་ལ་འདོད་ཆགས་པས་མ་ཡིན།
en: They do not respect the teachings merely because of any desires associated with family, views, or retinue.

source: གང་ཟག་གི་སྐྱོན་གྱི་ཕྱིར་བསླབ་པའི་གནས་དེ་དང་དེ་དག་ལ་རི་མོ་བྱེད་པ་མ་ཡིན་ཏེ།
en: Rather, they respect all the points of training because they are means for overcoming personal flaws.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སོ་སོར་ཐར་པའི་སྡོམ་པས་བསྡམས་པ་ཡིན་ནོ།
en: Such is the bodhisattvas’ commitment to the prātimokṣa vows.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་སེམས་དཔའི་བསླབ་པའི་སྡོམ་པས་བསྡམས་པ་ཡིན་ཞེ་ན།
en: “What, you may wonder, does the bodhisattvas’ commitment to the vows of the bodhisattva training consist in?

source: འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་འདི་སྙམ་དུ་སོ་སོར་ཐར་པའི་སྡོམ་པ་ཙམ་གྱིས་ནི།
en: Bodhisattvas recognize that through the prātimokṣa vows alone

source: བདག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་མི་ནུས་ཀྱིས།
en: they will not be able to fully awaken to unexcelled and complete buddhahood.

source: ཞེས་རྣམ་པར་དཔྱོད་དོ།
en: Thus they understand,

source: བྱང་ཆུབ་སེམས་དཔའི་ཡང་དག་པར་སྤྱད་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་བསླབ་པའི་གནས་འདི་དག་གང་བཅས་པ་དེ་དག་ལ་བདག་གིས་བསླབ་པར་བྱའོ་
en: ‘I must practice all the various bodhisattva practices and all the bodhisattva trainings

source: དེ་བཞིན་གཤེགས་པས་མདོ་སྡེ་དེ་དང་དེ་དག་ལས་
en: as they appear in the discourses of the Thus-Gone One.’

source: བྱང་ཆུབ་སེམས་དཔའི་ཡང་དག་པར་སྤྱད་པ་དེ་དག་ནི་གང་བྱང་ཆུབ་སེམས་དཔའི་བསླབ་པའི་གནས་དེ་རྣམས་ཀྱང་གང་ཞེ་ན།
en: What, then, are the genuine bodhisattva practices and what are the aspects of a bodhisattva’s training?

source: འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་གང་གི་ཕྱིར་དེ་ལ་སེམས་ཅན་རྣམས་དད་པར་འགྱུར་བའི་གནས་མ་ཡིན་པར་མི་སྤྱོད།
en: Bodhisattvas will not do anything that does not become a source of faith for sentient beings.

source: དུས་མ་ཡིན་པར་མི་སྤྱོད། ཡུལ་མ་ཡིན་པར་མི་སྤྱོད།
en: They will not do anything that is untimely or involves an improper object.

source: དུས་མ་ཡིན་པར་མི་སྨྲ་བ་ཡིན།
en: Neither will they say anything at the wrong time.

source: དུས་མི་ཤེས་པ་མ་ཡིན།
en: They are not unaware of the right time.

source: ཡུལ་མི་ཤེས་པ་མ་ཡིན། ཚོད་མི་ཤེས་པ་མ་ཡིན་ཏེ།
en: They do not lack knowledge of the appropriate objects, nor do they fail to know the right measure.

source: དེ་སེམས་ཅན་རྗེས་སུ་བསྲུང་བ་དང་།
en: They protect sentient beings.

source: བདག་གི་བྱང་ཆུབ་ཀྱི་ཚོགས་ཡོངས་སུ་རྫོགས་པར་བྱ་བའི་ཕྱིར་སྤྱོད་ལམ་ཕུན་སུམ་ཚོགས་ཤིང་
en: In order to complete the accumulations for their awakening they engage in excellent conduct.

source: འཇམ་པར་སྨྲ་བ་དང་། དལ་བུས་སྨྲ་བ་དང་། འདུ་འཛི་མི་མང་བ་དང་། རབ་ཏུ་དབེན་པ་ལ་མངོན་པར་ཕྱོགས་པ་དང་། བཞིན་གྱི་མདངས་རབ་ཏུ་དང་བ་ཡིན་ཏེ།
en: They speak softly and gently, avoid society, and turn toward complete seclusion with a bright smile on their faces.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཆོ་ག་ཕུན་སུམ་ཚོགས་པ་ཡིན་ནོ།
en: Such is the bodhisattvas’ excellent behavior.

source: དེ་བཞིན་གཤེགས་པས་མདོ་སྡེ་དེ་དང་དེ་དག་ལ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱིས་བསླབ་པའི་གནས་
en: Keeping all the different discourses taught by the Thus-Gone One as their reference points,

source: འདི་དག་གང་བཅས་པའི་བསླབ་པའི་གནས་དེ་དག་ལ་གུས་པར་བྱེད་པ་ཡིན། བརྩོན་པར་བྱེད་པ་ཡིན་ཏེ།
en: bodhisattvas respect and pursue all the points of training and all the prescriptions.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་སེམས་དཔའི་བསླབ་པའི་སྡོམ་པས་བསྡམས་པ་ཡིན་ནོ།
en: Such is the bodhisattvas’ commitment to the vows of bodhisattva training.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཉོན་མོངས་པ་ཐམས་ཅད་ཀྱིས་ཡོངས་སུ་གདུང་བ་དང་བྲལ་བ་ཡིན་ཞེ་ན།
en: “What, you may wonder, does the bodhisattvas’ freedom from the pains of the afflictions consist in?

source: འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་འདོད་ཆགས་ཀྱིས་ཡོངས་སུ་གདུང་བའམ།
en: Bodhisattvas do not suffer from the pains of desire,

source: ཞེ་སྡང་གིས་ཡོངས་སུ་གདུང་བའམ། གཏི་མུག་གིས་ཡོངས་སུ་གདུང་བའམ། ཉོན་མོངས་པས་ཡོངས་སུ་གདུང་བ་གང་ཡང་རུང་བ་ལ་ལའམ།
en: the pains of anger, the pains of dullness, the pains of any affliction,

source: ཡོ་བྱད་ཀྱིས་ཕོངས་པའི་ཡོངས་སུ་གདུང་བ་གང་ཡང་རུང་བ་ལ་ལས་ཡོངས་སུ་གདུང་བར་མི་འགྱུར་ཏེ།
en: or the pains of lacking material means.

source: དེ་འདོད་ཆགས་ཀྱི་གཉེན་པོ་ལ་རྟེན་ཅིང་འདོད་ཆགས་སྐྱེ་བའི་རྐྱེན་རྣམས་ཡོངས་སུ་སྤོང་ངོ་།
en: They apply the remedy for desire and abandon the conditions for desire.

source: འདོད་ཆགས་ཀྱི་གཉེན་པོ་དེ་ནི་གང་འདོད་ཆགས་སྐྱེ་བའི་རྐྱེན་དེ་དག་ནི་གང་ཞེ་ན།
en: What, then, is the remedy for desire and what is the condition for desire to arise?

source: མི་སྡུག་པ་སྒོམ་པ་ནི་འདོད་ཆགས་ཀྱི་གཉེན་པོའོ།
en: Contemplating repulsiveness serves as the remedy for desire

source: ཡུལ་གྱི་བཟང་མོ་ནི་འདོད་ཆགས་སྐྱེ་བའི་རྐྱེན་ཏོ།
en: that is caused by the appearance of a beautiful woman.

source: མི་སྡུག་པ་བསྒོམ་པ་དེ་གང་ཞེ་ན།
en: And what, you may wonder, is the contemplation of repulsiveness?

source: ལུས་འདི་ལ་སྐྲ་དང་། སྤུ་དང་། སེན་མོ་དང་། སོ་དང་། རྔུལ་དང་། དྲི་མ་དང་། པགས་པ་དང་། ཤ་དང་། རུས་པ་དང་། རྒྱུས་པ་དང་། རྩ་དང་། མཁལ་མ་དང་། སྙིང་དང་། མཆིན་པ་དང་། གློ་བ་དང་། རྒྱུ་མ་དང་། གཉེ་མ་དང་། ཕོ་བ་དང་། སུལ་མངས་དང་། ལོང་ཀ་དང་། ལྒང་པ་དང་། མཚེར་པ་དང་། ཕྱི་ས་དང་། མཆིལ་མ་དང་། རྡུལ་དང་། སྣབས་དང་། ངར་སྣབས་དང་། ཞག་དང་། ཆུ་སེར་དང་། རྐང་དང་། ཚིལ་དང་། མཁྲིས་པ་དང་། བད་ཀན་དང་། རྣག་དང་། ཁྲག་དང་། ཀླད་པ་དང་། ཀླད་རྒྱས་དང་། གཅིན་དག་ཀྱང་ཡོད་དེ།
en: a person’s hair, body hair, nails, teeth, sweat, secretions, skin, flesh, bone, muscles, veins, kidney, heart, liver, lungs, intestines, colon, stomach, entrails, innards, bladder, spleen, excrement, perspiration, mucus, nasal mucus, fat, lymph, marrow, grease, bile, discharge, pus, blood, brain, cerebrum, and urine.

source: དངོས་པོ་དེ་དག་ལ་བྱང་ཆུབ་སེམས་དཔའ་ཡོངས་སུ་རྟོག་པའི་རང་བཞིན་ཅན་ཡིན་ཏེ།
en: It is a bodhisattva’s nature to examine all these entities, and thus, such a thoughtful bodhisattva contemplates,

source: ཡོངས་སུ་རྟོག་པའི་རང་བཞིན་ཅན་དེ་འདི་སྙམ་དུ་བྱིས་པ་བླུན་པོ་མི་གསལ་བ་མི་མཁས་པ་དེ་ཡང་དངོས་པོ་འདི་དག་ཤེས་ནས།
en: ‘When childish fools who are dull and ignorant encounter these substances they do not feel any desire.

source: འདོད་ཆགས་ཀྱི་སེམས་མི་སྐྱེད་ན། ཤེས་རབ་དང་ལྡན་པའི་རང་བཞིན་ཅན་ལྟ་སྨོས་ཀྱང་ཅི་དགོས་སྙམ་སྟེ།
en: So needless to mention that an insightful person would not feel any desire either.’

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་མི་སྡུག་པ་སྒོམ་པ་མང་བ་ཡིན་ནོ།
en: In this way do bodhisattvas contemplate the repulsive extensively.

source: ཡུལ་གྱི་བཟང་མོ་དེ་གང་ཞེ་ན།
en: “What, then, is an object in the form of a beautiful woman?

source: འདི་ལ་བྱང་ཆུབ་སེམས་དཔས་ཆགས་པར་འགྱུར་བའི་བུད་མེད་གཟུགས་བཟང་བ།
en: If a bodhisattva sees a desirable lady of fine appearance

source: ཡིད་དུ་འོང་བ། མཛེས་པ། མིག་ཏུ་སྡུག་པ། སེམས་འཕྲོག་པ་
en: —someone endearing, beautiful, captivating, and stunning

source: འདི་ལྟར་ཡོངས་སུ་རྟོག་སྟེ།
en: —then he thinks as follows:

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཀྱང་ཡུལ་ནི་རྨི་ལམ་དང་འདྲ་བ་དག་སྟེ།
en: ‘The Blessed One has taught that all objects are just like a dream.

source: བྱུང་ནས་མེད་པར་འགྱུར་བ་ཡིན་ན་
en: They appear only to disappear again.

source: མཁས་པའི་རང་བཞིན་ཅན་སུ་ཞིག་རྨི་ལམ་ལྟ་བུའི་ཡུལ་དག་ལ་འདོད་ཆགས་སྐྱེད་པར་བྱེད་ཅེས་གསུངས་སོ་སྙམ་སྟེ།
en: So what knowledgeable person would feel any desire with respect to objects that are like a dream?’

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་འདོད་ཆགས་ཀྱི་གཉེན་པོ་ལ་སྟེན་ཅིང་འདོད་ཆགས་སྐྱེ་བའི་རྐྱེན་རྣམས་ཡོངས་སུ་སྤོང་ངོ་།
en: This is the way that bodhisattvas apply the remedy for desire and give up the conditions for desire to arise.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའི་ཞེ་སྡང་གི་གཉེན་པོ་ལ་སྟེན་ཅིང་ཞེ་སྡང་སྐྱེ་བའི་རྐྱེན་རྣམས་ཡོངས་སུ་སྤོང་ཞེ་ན།
en: “In what way, you may then wonder, do bodhisattvas apply the remedy for anger and how do they abandon the conditions for anger to arise?

source: འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་ཅན་རྣམས་ལ་བྱམས་པ་མང་བ་ཡིན་ཏེ།
en: Bodhisattvas have abundant love for sentient beings.

source: དེ་གཞི་གང་དང་རྒྱུ་གང་དང་རྐྱེན་གང་གིས་ཁྲོ་ཞིང་གནོད་སེམས་སུ་འགྱུར་བ་དང་། ཁོན་དུ་འཛིན་པར་འགྱུར་བའི་རྒྱུ་དེ་དག་དང་། རྐྱེན་དེ་དག་ཡོངས་སུ་སྤངས་ཏེ།
en: Hence, they give up the bases, causes, and conditions for anger, as well as the causes and conditions for ill will and resentment.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཞེ་སྡང་གི་གཉེན་པོ་ལ་རྟེན་ཅིང་ཞེ་སྡང་སྐྱེ་བའི་རྐྱེན་རྣམས་ཡོངས་སུ་སྤོང་བ་ཡིན་ནོ།
en: This is the way that bodhisattvas apply the remedy for anger and give up the conditions for anger to arise.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་གཏི་མུག་གི་གཉེན་པོ་ལ་སྟེན་ཅིང་། གཏི་མུག་སྐྱེ་བའི་རྐྱེན་རྣམས་ཡོངས་སུ་སྤོང་ཞེ་ན།
en: “In what way, you may then wonder, do bodhisattvas apply the remedy for dullness and how do they abandon the conditions for dullness to arise?

source: དེ་དེ་ལྟར་ཡོངས་སུ་རྟོག་པས་གཏི་མུག་དང་བྲལ་བར་འགྱུར་རོ།
en: Bodhisattvas are free of dullness due to their understanding.

source: གཏི་མུག་དང་བྲལ་བས་འདོད་པ་མ་འབྱོར་ཏམ། ཡོ་བྱད་མ་འབྱོར་ཀྱང་ཡོངས་སུ་ཡི་འཆད་པ་མེད་དེ།
en: Moreover, because they are free of dullness they do not lose heart when things do not work out as they wished, or when they are lacking material means,

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཉོན་མོངས་པ་ཐམས་ཅད་ཀྱིས་ཡོངས་སུ་གདུང་བ་དང་བྲལ་བ་ཡིན་ནོ།
en: and thus they are free of all the pains of affliction.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཚུལ་བཞིན་མ་ཡིན་པའི་ཡིད་ལ་བྱེད་པ་དང་བྲལ་བ་ཡིན་ཞེ་ན།
en: “What, you may wonder, does the bodhisattvas’ freedom from incorrect mental engagements consist in?

source: འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་གཅིག་པུ་ལྐོག་ཏུ་སོང་སྟེ། རབ་ཏུ་དབེན་པ་ན་
en: Alone and in secrecy, bodhisattvas may leave for their hermitage.

source: གནས་ཤིང་འདི་ལྟར་བདག་ནི་མ་འདྲེས་པར་གནས་པ་སྟེ། བདག་ནི་རབ་ཏུ་དབེན་པ་ན་འདུག་པའོ། །བདག་ནི་དེ་བཞིན་གཤེགས་པའི་ཆོས་འདུལ་བ་ལ་ཞུགས་པའོ།
en: ‘Living here in solitude I am following the Dharma-Vinaya of the Thus-Gone One.

source: དགེ་སྦྱོང་ངམ། བྲམ་ཟེ་གཞན་དག་ནི་ཀུན་ཀྱང་འདྲེས་པར་གནས་པ། འདུ་འཛི་མང་བ།
en: Other mendicants, or brahmins, live with people and are engaged in plenty of social activity.

source: དེ་བཞིན་གཤེགས་པའི་ཆོས་འདུལ་བ་ལས་ཉམས་པའོ་སྙམ་དུ་སེམས་མི་སྐྱེད་དེ།
en: So they have strayed from the Dharma-Vinaya of the Thus-Gone One.’

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཚུལ་བཞིན་མ་ཡིན་པ་ཡིད་ལ་བྱེད་པ་དང་བྲལ་བ་ཡིན་ནོ།
en: Such is the bodhisattvas’ freedom from incorrect mental engagements.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ལས་ཀྱིས་འཇིགས་པ་ཡིན་ཞེ་ན།
en: “What, you may wonder, does the bodhisattvas’ fear of karma consist in?

source: འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་འདི་ལྟར་བཅོམ་ལྡན་འདས་ཀྱིས་ཀྱང་
en: Bodhisattvas consider how the Blessed One has taught:

source: དགེ་སློང་རྣམས་བསོད་ནམས་དག་གུས་པར་བྱའོ།
en: ‘Monks, virtuous acts must be engaged in with respect,

source: ཚུལ་ཁྲིམས་གུས་པར་བསྲུང་ངོ་།
en: discipline must be observed with respect,

source: ཤེས་རབ་གུས་པར་བསྒོམ་མོ།
en: insight must be cultivated with respect.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Why is that?

source: བསོད་ནམས་གུས་པར་བྱས་པ་རྣམས་ཀྱི་རྣམ་པར་སྨིན་པ་ནི་འདོད་པ་དང་། འཐད་པ་དང་། དགའ་བ་དང་། ཡིད་དུ་འོང་བར་ཉམས་སུ་མྱོང་བར་འགྱུར་རོ།
en: Because when one acts with respect for virtue the karmic ripening will be experienced as desirable, sensible, delightful, and beautiful.’

source: དེ་དེ་ལྟར་མངོན་པར་ཡིད་ཆེས་པས་མི་དགེ་བའི་ཆོས་ཐམས་ཅད་དང་བྲལ་བར་འགྱུར་ཏེ།
en: With conviction in that teaching, they avoid all unvirtuous qualities.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ལས་ཀྱིས་འཇིགས་པ་ཡིན་ནོ།
en: Such is the bodhisattvas’ fear of karma.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཁ་ན་མ་ཐོ་བས་འཇིགས་པ་ཡིན་ཞེ་ན།
en: “What, you may wonder, does the bodhisattvas’ fear of evil consist in?

source: འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་ཁ་ན་མ་ཐོ་བ་ཕྲ་མོ་ཙམ་དག་ལ་ཡང་འཇིགས་པར་ལྟ་ཞིང་སྡིག་པ་ཆུང་ངུ་ཡང་ཁྱད་དུ་མི་གསོད་པ་ཡིན་ཏེ།
en: Bodhisattvas perceive even very subtle forms of evil as something frightening and they are careful to avoid even minor forms of negativity.

source: དེ་འདི་སྙམ་དུ་བཅོམ་ལྡན་འདས་ཀྱིས་ཀྱང་
en: As such, they consider how the Blessed One has taught:

source: དགེ་སློང་དག་དུག་ཆུང་ངུས་ཀྱང་སྐྱེས་བུ་འཆི་བར་འགྱུར་རོ། །དགེ་སློང་དག་དུག་ཆེན་པོས་ཀྱང་སྐྱེས་བུ་འཆི་བར་འགྱུར་རོ།
en: ‘Monks, people can die from weak poison just as they die from strong poison.

source: དེ་བཞིན་དུ་སྡིག་པ་ཆུང་ངུས་ཀྱང་ངན་སོང་རྣམས་སུ་ཕྱིན་པར་བྱེད་དོ། །སྡིག་པ་ཆེན་པོས་ཀྱང་ངན་སོང་རྣམས་སུ་ཕྱིན་པར་བྱེད་དོ་ཞེས་གསུངས་སོ་
en: In the same way, lesser negativity takes one to the lower realms just as great negativity does.’

source: དེ་དེ་ལྟར་ཡོངས་སུ་རྟོག་པས་ཁ་ན་མ་ཐོ་བས་འཇིགས་པ་ཡིན་ཏེ། དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཁ་ན་མ་ཐོ་བས་འཇིགས་པ་ཡིན་ནོ།
en: With this in mind they are afraid of evil, and this, then, is the bodhisattvas’ fear of evil.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་འཇིགས་པར་ལྟ་བ་ཡིན་ཞེ་ན།
en: “What, you may wonder, does the bodhisattvas’ consideration of danger consist in?
